/*******************************************************************************
    * @文件  ： singleServo.ino
    * @笔者  ： 云上太阳
    * @版本  ： V2.0
    * @日期  ： 2017年08月08日
    * @功能  ： 单个舵机的串口控制
    * @所属  ： 杭州众灵科技                  
********************************************************************************/
/*----------------------------------------------------------------------------
    相关库函数:
    1.servo类成员函数
    attach()              设定舵机的接口，只有9或10接口可利用。
    write()               用于设定舵机旋转角度的语句，可设定的角度范围是0°到180°。
    writeMicroseconds()　 用于设定舵机旋转角度的语句，直接用微秒作为参数。
    read()                用于读取舵机角度的语句，可理解为读取最后一条write()命令中的值。
    attached()            判断舵机参数是否已发送到舵机所在接口。
    detach()              使舵机与其接口分离，该接口（9或10）可继续被用作PWM接口。
    更新日志:
    2017-08-08 V2.0版本
  ----------------------------------------------------------------------------*/
#include <Servo.h>                // 声明调用Servo.h库
Servo myservo;                    //创建一个舵机类
#define  SERVO_PIN  10            //宏定义舵机控制引脚
unsigned int PWM = 0;             //变量pwm用来存储舵机角度位置,PWM的500对应0度，2500对应舵机的最大角度
                                  //（180度舵机2500对应180度，270度舵机2500对应270度）
void singleServoControl(){
    for(PWM = 50; PWM <2450; PWM += 5){   //舵机从50状态转到2450，每次增加5  
        myservo.writeMicroseconds(PWM);   //给舵机写入PWM  
        delay(10);                        //延时10ms让舵机转到指定位置
    } 
    for(PWM = 2450; PWM>50; PWM-=5){     
        myservo.writeMicroseconds(PWM);    
        delay(10);                       
    }        
}                               
void setup(){ 
    myservo.attach(SERVO_PIN);    // 将10引脚与声明的舵机对象连接起来
} 

void loop(){ 
    singleServoControl();
} 
